{
    "Release": {
        "VersionMajor": 0,
        "VersionMinor": 57,
        "VersionPatch": 3,
        "Changes": "<b>Version 0.57.3:</b><br><br>- Added Discord Rich Presence (credit Koi)<br>- SV AutoStory has been extended to Levincia Gym. (credit jw)<br>- The ESP32-S3 now supports a standard keyboard for ease of typing in text on the Switch. For now this will only work correctly on US keyboard layout (QWERTY). The others are still a work in progress.<br>- FCE programs will now be able to use the keyboard mode in the ESP32-S3. 6-character raid codes can be entered faster than you can blink.<br>- FCE programs will try to detect your Switch type early if you didn't specify it.<br>- AutoDA will more aggressively try to detect (and warn) if you set the language incorrectly.<br>- Improved reliability of LGPE Legendary Reset for detecting the battle menu.<br>- The ESP32 should be less prone to silent disconnects. (from error reports)<br>- The ESP32 will now detect silent disconnects and try to reconnect*.<br>- Misc. reliability improvements to SwSh programs.<br>- Keyboard controls no longer log what commands are sent to the Switch due to privacy concerns.**<br><br>*This reconnect only works on the Switch 2 and always fails on the Switch 1. This goes back to the (still unfixed) issue where we cannot get the ESP32 to reconnect to the Switch 1 outside of the grip menu - though it works perfectly on the Switch 2.<br><br>**Logging of keyboard controls is a big privacy/security issue as people using it to sign into their Nintendo account or e-shop will get their key presses logged. While this wasn't an issue in the past since it was unwieldy to enter a password using a game controller, this changes with the addition of the HID keyboard support. We anticipate that a lot more people will be using CC to enter passwords. So we are preemptively disabling all logging of keyboard controls."
    },
    "Beta": {
        "VersionMajor": 0,
        "VersionMinor": 54,
        "VersionPatch": 24,
        "Changes": "<b>Version 0.54.24 (Release Candidate):</b><br><br>- Added partial support for the Switch 2 GR and GL buttons. All keyboard settings will be reset to default due to the button mappings shifting.<br>- Fixed Arduino/Teensy and ESP32-S3 controllers hanging if the Switch refuses the connection. New firmware will be needed.<br>- Fixed all PLA programs that navigate regions being broken. (regression in v0.54.12)<br>- The Home Box Sorter should recognize PLA balls now.<br>- Fixed SBB allowing joysticks to go diagonally out-of-bounds. (reported by Koi)<br>- Fixed a possible deadlock with SBB.<br>- Fixed an issue in the button scheduler where it may issue incorrect commands.<br>- Various stability improvements to CC itself."
    },
    "PrivateBeta": {
        "VersionMajor": 0,
        "VersionMinor": 56,
        "VersionPatch": 4,
        "Changes": "<b>Version 0.56.4 (beta):</b><br><br>- The ESP32 will now connect to the Switch 2!<br>- The ESP32-S3 now lets you pick between the Switch 1 and Switch 2 wired controllers.<br>- Improved reliability of SV eggs with a new path to navigate to the egg basket.<br>- SV egg programs will fix your game settings.<br>- SV egg programs will warn you if it thinks your language is wrong.<br>- Fixed another program crash. (from error reports)<br><br>A lot of changes happened to the firmware, so you will need to flash new .hex and .bin files regardless of what you are using.<br><br>Note that all 4 shiny hunting LGPE programs have been affected by the new firmware changes due to the game disconnecting all controllers when SR'ing. This \"just happened\" to work in the past, but with the new firmware, it has become a lot more delicate.<br><br>As of today, these 4 programs should be working fine on the Switch 2 (only Gift Reset has been tested). But Switch 1 is more precarious since we are unable to get the ESP32 to reliably reconnect to the Switch outside of the grip menu. (for some reason it works perfectly on the Switch 2 - ironic yes)"
    }
}
