{
    "Release": {
        "VersionMajor": 0,
        "VersionMinor": 61,
        "VersionPatch": 3,
        "Changes": "<b>Version 0.61.3:</b><br><br>Happy new years everyone!<br><br>- Added Donut Maker. (credit kichi, Gin)<br>- Added Hyperspace Reward Reset. (credit kichi)<br>- Added Wigglytuff Farmer for side mission 157. (credit Saber)<br>- Added PLZA Box Sorter. (credit Gin)<br>- Added Weather Finder. (credit Icaroto)<br>- Turbo Macro now uses [-1.0, 1.0] for joysticks instead of [0, 255]. Y-axis has been uninverted so +1 is up.<br>- Old Turbo Macro scripts will automatically convert to the new joystick format.<br>- OEM controllers will now show player lights and the last 2 bytes of the MAC address of the paired console.*<br>- Home Box Sorter can now sort by alphas. (credit Gin)<br>- Fixed keyboard controls not working on popped out video. (reported by rishino)<br>- Increase Post-Kill Catcher scroll distance to +/- 15. (reported by jojoaman)<br>- Logs will now spill to a new file when they get too large. (credit jw)<br>- If the serial connection dies, it will now show a popup error. (reported by jayfeather1)<br>- Improved reliability of Home Box Sorter. (credit Gin)<br>- Improved wiki for Home Box Sorter. (credit Gin)<br>- Improved map detection. (reported by techenpro, credit Gin)<br>- Improved reliability of overworld detection. (credit Gin)<br>- Improved reliability of box detection. (reported by Dhruv, Quantum, credit Gin)<br>- Improved reliability of Fly Spot Reset for Zone 19. (credit Saber)<br>- Minor fixes to AutoDA.<br>- Fixed an issue with the SV let's go kill routine affecting: Area Zero Platform, Scatterbug, and Material Farmer<br>- DPP updated to 10.0.28 and normalized for all platforms (Windows, Mac, Linux). (credit Koi)<br>- New Pico firmware with a promising fix for an ongoing issue where it may hang in Sword/Shield. (reported by h0ly0 and tryvl)<br>- ESP32, ESP32-S3, and Pico firmware toolchains have been updated to latest.<br>- Support for sbb2 has been discontinued. Please use sbb3.<br><br>This is the initial release of the Donut program. However, we are not done with it.<br><br>The original plan was to use sprite matching to detect the donut powers. However, that ended up dragging on for too long and we needed to get something out the door. So for this initial release, we fell back to the less reliable method of text recognition.<br><br>We are already aware of multiple issues/misreads with the current method. So please bare with us while we continue working on sprite matching.<br><br>*Requires flashing new firmware. Old firmware remains the same as before."
    },
    "Beta": {
        "VersionMajor": 0,
        "VersionMinor": 59,
        "VersionPatch": 5,
        "Changes": "<b>Version 0.59.5:</b><br><br>- The Restaurant Farmer can now automatically select moves based on type effectiveness.<br>- Hopefully fixed more Restaurant Farmer hangs. (reported by numerous people)<br>- Bench Sit should be less CPU resource intensive. (reported by dlewis3040)<br><br><b>Version 0.59.4:</b><br><br>- The Restaurant Farmer now has a button to stop after the current run.<br>- More fixes to the Restaurant Farmer. (reported by elitheguy, frostedgeulleisia, and mendedpearl)"
    },
    "PrivateBeta": {
        "VersionMajor": 0,
        "VersionMinor": 61,
        "VersionPatch": 2,
        "Changes": "<b>Version 0.61.2 (beta):</b><br><br>- Added preliminary Donut Maker. (credit kichi, Gin)<br>- Improved reliability of box detection. (reported by Dhruv, Quantum, credit Gin)<br>- If the serial connection dies, it will now show a popup error. (reported by jayfeather1)<br>- New Pico firmware with a promising fix for an ongoing issue where it may hang in Sword/Shield. (reported by h0ly0 and tryvl)<br><br>This beta contains a preliminary release of the Donut Maker that uses text recognition for the powers. Text recognition is unreliable so we intended to do a more robust implementation using sprite detection. But that was taking too long. So we are starting with a quick-and-dirty version using only text. If it proves unreliable as predicted, we'll follow up later with sprite matching.<br><br>Meanwhile the legendary hunting program is underway though it won't be easy either."
    }
}
