{
    "Release": {
        "VersionMajor": 0,
        "VersionMinor": 55,
        "VersionPatch": 2,
        "Changes": "<b>Version 0.55.2:</b><br>- Fixed the program crashing when rapidly resetting videos.<br>- Improved reliability of SwSh dialog box detection. (reported by arnim1203)<br>- Increased SV shiny egg detection window to decrease chance of missed shiny. (reported by mathieuj75)<br><br><b>New Features:</b><br>- Added a beta program for farming SV mystery gifts by playing from game start to the first Pokemon center. <a href=\"https://youtu.be/F6uf7MzdBY0\" style=\"color: #0080ff\">Demo Video</a><br>- Added support for the Switch 2 C (GameChat) button for wired controllers.<br><br><b>Bug Fixes / QoL Improvements:</b><br>- Major fixes and stability improvements to AutoStory.<br>- AutoDA is now tolerant to nicknames and add-to-party being enabled.<br>- SV egg programs will ask you to check your Camera Support option if it can't find the basket.<br>- PLA programs that reset will tell you if it thinks you didn't save in Jubilife.<br>- Fixed Regigigas on Switch 2.<br>- Fixed date spam not working in German on Switch 2.<br>- Improved stability of ESP32 datespam.<br>- Reduce chance of false positive Tera rewards menu detection.<br>- Fixed Home Box Sorter not reading master balls.<br>- Fixed some Pokémon names not being correctly read in Chinese simplified due to name changes.<br>- Improved reliability of Y-COMM symbol detector.<br>- Fixed load profile not loading the resolution.<br>- Fixed some crashes."
    },
    "Beta": {
        "VersionMajor": 0,
        "VersionMinor": 54,
        "VersionPatch": 24,
        "Changes": "<b>Version 0.54.24 (Release Candidate):</b><br><br>- Added partial support for the Switch 2 GR and GL buttons. All keyboard settings will be reset to default due to the button mappings shifting.<br>- Fixed Arduino/Teensy and ESP32-S3 controllers hanging if the Switch refuses the connection. New firmware will be needed.<br>- Fixed all PLA programs that navigate regions being broken. (regression in v0.54.12)<br>- The Home Box Sorter should recognize PLA balls now.<br>- Fixed SBB allowing joysticks to go diagonally out-of-bounds. (reported by Koi)<br>- Fixed a possible deadlock with SBB.<br>- Fixed an issue in the button scheduler where it may issue incorrect commands.<br>- Various stability improvements to CC itself."
    },
    "PrivateBeta": {
        "VersionMajor": 0,
        "VersionMinor": 54,
        "VersionPatch": 6,
        "Changes": "<b>Version 0.54.6:</b><br>- Fixed incorrect detection user select on Switch 2. (reported by Zing)<br><br><b>Version 0.54.5:</b><br>- Improved detection of console type. (Switch 1 vs. Switch 2 international vs. Switch 2 Japan-locked) Most programs will be able to run without specifying the console type.<br>- Programs will now error out if the detected console type disagrees with the user selection.<br>- Fixed a serious issue with audio playback.<br>- Fixed various issues with the SV sandwich maker. (reported by babs)<br>- Improved reliability of Shaymin shiny hunt. (reported by .functionfrank)<br>- Improved reliability of LGPE legendary reset.<br>- Improved reliability of date-spam routines.<br>- Fixed SwSh Regi light corrections.<br>- Fixed LGPE gift reset not recovering from errors.<br>- Switch 2: Fixed update menu detection. It will now detect both firmware and game updates and bypass them."
    }
}
