{
    "Release": {
        "VersionMajor": 0,
        "VersionMinor": 59,
        "VersionPatch": 6,
        "Changes": "<b>Version 0.59.6:</b><br><br>- Added Wild Zone Entrance reset for shiny hunting. (credit Saber)<br>- Added Mega Shard Farmer.<br>- Reliability improvements to Restaurant Farmer. (reported by kennyexile)<br>- Bench Sit now has an option to walk forward to increase spawn coverage.<br>- Fixed a potential crash in the video pipeline. (reported by jayco_tv2)<br>- Removed the option to notify on every shiny sound."
    },
    "Beta": {
        "VersionMajor": 0,
        "VersionMinor": 59,
        "VersionPatch": 5,
        "Changes": "<b>Version 0.59.5:</b><br><br>- The Restaurant Farmer can now automatically select moves based on type effectiveness.<br>- Hopefully fixed more Restaurant Farmer hangs. (reported by numerous people)<br>- Bench Sit should be less CPU resource intensive. (reported by dlewis3040)<br><br><b>Version 0.59.4:</b><br><br>- The Restaurant Farmer now has a button to stop after the current run.<br>- More fixes to the Restaurant Farmer. (reported by elitheguy, frostedgeulleisia, and mendedpearl)"
    },
    "PrivateBeta": {
        "VersionMajor": 0,
        "VersionMinor": 56,
        "VersionPatch": 4,
        "Changes": "<b>Version 0.56.4 (beta):</b><br><br>- The ESP32 will now connect to the Switch 2!<br>- The ESP32-S3 now lets you pick between the Switch 1 and Switch 2 wired controllers.<br>- Improved reliability of SV eggs with a new path to navigate to the egg basket.<br>- SV egg programs will fix your game settings.<br>- SV egg programs will warn you if it thinks your language is wrong.<br>- Fixed another program crash. (from error reports)<br><br>A lot of changes happened to the firmware, so you will need to flash new .hex and .bin files regardless of what you are using.<br><br>Note that all 4 shiny hunting LGPE programs have been affected by the new firmware changes due to the game disconnecting all controllers when SR'ing. This \"just happened\" to work in the past, but with the new firmware, it has become a lot more delicate.<br><br>As of today, these 4 programs should be working fine on the Switch 2 (only Gift Reset has been tested). But Switch 1 is more precarious since we are unable to get the ESP32 to reliably reconnect to the Switch outside of the grip menu. (for some reason it works perfectly on the Switch 2 - ironic yes)"
    }
}
