{
    "Release": {
        "VersionMajor": 0,
        "VersionMinor": 60,
        "VersionPatch": 8,
        "Changes": "<b>Release v0.60.8:</b><br><br>Bugfixes only. No real DLC stuff yet.<br><br>- Fixed Wild Zone 20 for DLC. (credit Gin)<br>- Fixed some more Turbo Macro and Keyboard Recorder incompatibilities. (reported by Dhruv)<br>- Fixed some CC hangs.<br><br>You will likely need to flash new firmware for this release.<br><br>Those of you with ESP32-S3 and/or Pico W (UART) mode may something new that hasn't been documented yet. Feel free to poke around and to ask us about it in chat. But we'll announce those when our documentation is ready. (which might take a while since we're all busy)"
    },
    "Beta": {
        "VersionMajor": 0,
        "VersionMinor": 59,
        "VersionPatch": 5,
        "Changes": "<b>Version 0.59.5:</b><br><br>- The Restaurant Farmer can now automatically select moves based on type effectiveness.<br>- Hopefully fixed more Restaurant Farmer hangs. (reported by numerous people)<br>- Bench Sit should be less CPU resource intensive. (reported by dlewis3040)<br><br><b>Version 0.59.4:</b><br><br>- The Restaurant Farmer now has a button to stop after the current run.<br>- More fixes to the Restaurant Farmer. (reported by elitheguy, frostedgeulleisia, and mendedpearl)"
    },
    "PrivateBeta": {
        "VersionMajor": 0,
        "VersionMinor": 56,
        "VersionPatch": 4,
        "Changes": "<b>Version 0.56.4 (beta):</b><br><br>- The ESP32 will now connect to the Switch 2!<br>- The ESP32-S3 now lets you pick between the Switch 1 and Switch 2 wired controllers.<br>- Improved reliability of SV eggs with a new path to navigate to the egg basket.<br>- SV egg programs will fix your game settings.<br>- SV egg programs will warn you if it thinks your language is wrong.<br>- Fixed another program crash. (from error reports)<br><br>A lot of changes happened to the firmware, so you will need to flash new .hex and .bin files regardless of what you are using.<br><br>Note that all 4 shiny hunting LGPE programs have been affected by the new firmware changes due to the game disconnecting all controllers when SR'ing. This \"just happened\" to work in the past, but with the new firmware, it has become a lot more delicate.<br><br>As of today, these 4 programs should be working fine on the Switch 2 (only Gift Reset has been tested). But Switch 1 is more precarious since we are unable to get the ESP32 to reliably reconnect to the Switch outside of the grip menu. (for some reason it works perfectly on the Switch 2 - ironic yes)"
    }
}
