{
    "Release": {
        "VersionMajor": 0,
        "VersionMinor": 53,
        "VersionPatch": 3,
        "Changes": "<b>Changes:</b><br>- Fixed date-spam for LGPE programs.<br>- Date-spam has been tweaked to be less likely to sleep your Switch when it messes up.<br>- Fixed an issue that may cause programs to hang when stopping."
    },
    "Beta": {
        "VersionMajor": 0,
        "VersionMinor": 54,
        "VersionPatch": 21,
        "Changes": "<b>Version 0.54.21 (beta):</b><br><br>- Fixed a major issue with the wired controllers that caused button drops leading to severe program stability issues. (reported by ry, pat)<br>- Performance optimizations to SwSh + BDSP shiny detection on 4k.<br>- Area Zero Platform Bot and Scatterbug programs will now properly detect chained encounters including chained shiny encounters. Chain attacks are extremely common on Switch 2 due to the increased # of spawns.<br>- Fixed Material Farmer and Scatterbug programs not working on 4k.<br>- Fixed some program crashes and hangs.<br>- Fixed SV Mass Release. (reported by teddi.001)<br>- SV Egg autonomous will now recover from getting attacked. (reported by alex75772)<br>- Misc. Fixes to the BBQ Farmer (credit kichi)<br>- Improved reliability of the Item Printer. (reported by Sheep Punter)<br>- Improved reliability of BDSP eggs. (reported by Zing)<br>- Fixed code entry being broken on sys-botbase.<br>- Removed SleepyDiscord backend for Discord integration.<br><br>You will need to flash new firmware for all controllers."
    },
    "PrivateBeta": {
        "VersionMajor": 0,
        "VersionMinor": 54,
        "VersionPatch": 6,
        "Changes": "<b>Version 0.54.6:</b><br>- Fixed incorrect detection user select on Switch 2. (reported by Zing)<br><br><b>Version 0.54.5:</b><br>- Improved detection of console type. (Switch 1 vs. Switch 2 international vs. Switch 2 Japan-locked) Most programs will be able to run without specifying the console type.<br>- Programs will now error out if the detected console type disagrees with the user selection.<br>- Fixed a serious issue with audio playback.<br>- Fixed various issues with the SV sandwich maker. (reported by babs)<br>- Improved reliability of Shaymin shiny hunt. (reported by .functionfrank)<br>- Improved reliability of LGPE legendary reset.<br>- Improved reliability of date-spam routines.<br>- Fixed SwSh Regi light corrections.<br>- Fixed LGPE gift reset not recovering from errors.<br>- Switch 2: Fixed update menu detection. It will now detect both firmware and game updates and bypass them."
    }
}
