{
    "Release": {
        "VersionMajor": 0,
        "VersionMinor": 58,
        "VersionPatch": 3,
        "Changes": "<b>Version 0.58.3: (bugfixes)</b><br>- SV AutoStory has been extended to Medali Gym. (credit jw)<br>- Rolled back DPP to fix a major crash in Discord integration. (credit Saber)<br>- Improved reliability of LGPE programs that reset the game. New firmware will be needed for both ESP32 and Pico W. (reported by frost)<br>- Fixed some program crashes.<br>- Fixed some program hangs and poor responsiveness.<br>- Minor UI changes.<br>- Pico W will now log rumble events. (requires new firmware)<br><br><br><br><b>Version 0.58.2:</b><br>- Support for Raspberry Pi Pico W and Pico 2 W has been officially released from beta.<br>- AutoStory has been extended to Orthworm. (credit jw)<br>- Fixed an issue in all firmware that may cause dropped buttons.<br>- Stability improvements to AutoDA. (reported by Saber)<br>- Improved reliability of sandwich OCR.<br>- Minor UI changes.<br><br>This is the last (feature) release until PZA. The main purpose is to get Pico W released in time for the PZA hype."
    },
    "Beta": {
        "VersionMajor": 0,
        "VersionMinor": 54,
        "VersionPatch": 24,
        "Changes": "<b>Version 0.54.24 (Release Candidate):</b><br><br>- Added partial support for the Switch 2 GR and GL buttons. All keyboard settings will be reset to default due to the button mappings shifting.<br>- Fixed Arduino/Teensy and ESP32-S3 controllers hanging if the Switch refuses the connection. New firmware will be needed.<br>- Fixed all PLA programs that navigate regions being broken. (regression in v0.54.12)<br>- The Home Box Sorter should recognize PLA balls now.<br>- Fixed SBB allowing joysticks to go diagonally out-of-bounds. (reported by Koi)<br>- Fixed a possible deadlock with SBB.<br>- Fixed an issue in the button scheduler where it may issue incorrect commands.<br>- Various stability improvements to CC itself."
    },
    "PrivateBeta": {
        "VersionMajor": 0,
        "VersionMinor": 56,
        "VersionPatch": 4,
        "Changes": "<b>Version 0.56.4 (beta):</b><br><br>- The ESP32 will now connect to the Switch 2!<br>- The ESP32-S3 now lets you pick between the Switch 1 and Switch 2 wired controllers.<br>- Improved reliability of SV eggs with a new path to navigate to the egg basket.<br>- SV egg programs will fix your game settings.<br>- SV egg programs will warn you if it thinks your language is wrong.<br>- Fixed another program crash. (from error reports)<br><br>A lot of changes happened to the firmware, so you will need to flash new .hex and .bin files regardless of what you are using.<br><br>Note that all 4 shiny hunting LGPE programs have been affected by the new firmware changes due to the game disconnecting all controllers when SR'ing. This \"just happened\" to work in the past, but with the new firmware, it has become a lot more delicate.<br><br>As of today, these 4 programs should be working fine on the Switch 2 (only Gift Reset has been tested). But Switch 1 is more precarious since we are unable to get the ESP32 to reliably reconnect to the Switch outside of the grip menu. (for some reason it works perfectly on the Switch 2 - ironic yes)"
    }
}
