{
    "Release": {
        "VersionMajor": 0,
        "VersionMinor": 61,
        "VersionPatch": 9,
        "Changes": "<b>Version 0.61.10:</b><br><br>- Improved reliability of SV Auto Story. (reported by danilosvc, jojoaman, credit jw)<br>- Improved reliability of game resets.<br>- Improved reliability of code entry. (reported by gardivanyth)<br><br><b>Version 0.61.9:</b><br><br>- Added Hyperspace Legendary hunting. (credit Gin, Gimikyu, MrDonders, wakaraina, theastrogoth + lots of others)<br>- Add Magearna Stats Reset. (credit Nymphea)<br>- Add Meltan/Melmetal Stats Reset. (credit Nymphea)<br>- Improved config UI for Fly Spot Reset. (credit Gin)<br>- Improved reliability of Donut maker. (credit Gin, Gimikyu)<br>- Improved reliability of PLZA Box Sorter. (credit Gin)<br>- Improved reliability of Floette Stats Reset.<br>- Improved reliability of fly reset in hyperspace. (reported by soucouyant, credit Gin)<br>- Improved reliability of AutoStory for the Titan battles. (reported by cristianaxe, credit jw)<br>- Improved reliability of code entry. (reported by gardivanyth)<br>- Added Daily Highlight RNG to public beta. (credit fye)<br>- Move AutoStory and Mystery Gift out of public beta section.<br>- When opening a game that requires internet, the program will try to recover from being unable to connect to the internet. (credit pifopi)<br>- SV Egg Autonomous how has a button to stop after current batch. (credit ArceusMI)<br>- In AutoDA Boss Finder, the table has been unlocked while running.<br>- Improved reliability of AutoDA.<br>- Decreased CPU usage for Mac builds. (credit Gin)<br>- Randomized OEM controllers have more color variety.<br>- The default colors for an OEM controller is now consistent across program instances. (hashed from MAC address)<br>- Fix serial error spam on Linux. (reported by murdererfight)<br>- Fix a crash on Linux. (reported by murdererfight)<br><br>This release wraps up the main phase of PLZA development. While there is still a lot of things left to automate in PLZA, most of the low-hanging fruit has been covered now. Therefore, some (most?) of the devs will be moving onto infra work as we prepare for what appears to be the upcoming insanity of CFW-less gen10.<br><br>Stay tuned for more updates - especially if you are a machine learning or AI developer/researcher. If you haven't already <a href=\"https://discord.gg/TUYuxeKgFg\" style=\"color: #0080ff\">joined our Discord yet</a>, please do so as that's where the announcements will be happening."
    },
    "Beta": {
        "VersionMajor": 0,
        "VersionMinor": 59,
        "VersionPatch": 5,
        "Changes": "<b>Version 0.59.5:</b><br><br>- The Restaurant Farmer can now automatically select moves based on type effectiveness.<br>- Hopefully fixed more Restaurant Farmer hangs. (reported by numerous people)<br>- Bench Sit should be less CPU resource intensive. (reported by dlewis3040)<br><br><b>Version 0.59.4:</b><br><br>- The Restaurant Farmer now has a button to stop after the current run.<br>- More fixes to the Restaurant Farmer. (reported by elitheguy, frostedgeulleisia, and mendedpearl)"
    },
    "PrivateBeta": {
        "VersionMajor": 0,
        "VersionMinor": 61,
        "VersionPatch": 2,
        "Changes": "<b>Version 0.61.2 (beta):</b><br><br>- Added preliminary Donut Maker. (credit kichi, Gin)<br>- Improved reliability of box detection. (reported by Dhruv, Quantum, credit Gin)<br>- If the serial connection dies, it will now show a popup error. (reported by jayfeather1)<br>- New Pico firmware with a promising fix for an ongoing issue where it may hang in Sword/Shield. (reported by h0ly0 and tryvl)<br><br>This beta contains a preliminary release of the Donut Maker that uses text recognition for the powers. Text recognition is unreliable so we intended to do a more robust implementation using sprite detection. But that was taking too long. So we are starting with a quick-and-dirty version using only text. If it proves unreliable as predicted, we'll follow up later with sprite matching.<br><br>Meanwhile the legendary hunting program is underway though it won't be easy either."
    }
}
