{
    "Release": {
        "VersionMajor": 0,
        "VersionMinor": 60,
        "VersionPatch": 9,
        "Changes": "<b>Release v0.60.9:</b><br><br>There are multiple DLC programs in the works, but none are ready yet. So stay tuned. Meanwhile, there's something else new to play with...<br><br>- Added support for wired OEM controllers. (wired Pro Controller and wired Joycon)<br>- Fly Spot Reset now supports Hyperspace wild zones. (credit Gin)<br>- Added Helioptile Hunter using weather detection. (credit Icaroto)<br>- Re-added Sewer Hunter which was accidentally disabled in the last release.<br>- Keyboard controls have been rewritten for some future plans. If you have custom keyboard mappings, you will need to redo them.<br>- Fixed battles sometimes not picking a move - affecting Jacinthe Farmer. (reported by jojoaman and kichi)<br>- Fixed duration fields jumping the cursor around. (reported by bgoproton)<br><br>Wired OEM controllers were actually released in the previous version (v0.60.8). But the wiki wasn't ready for it at the time. So it is being announced as part of this release."
    },
    "Beta": {
        "VersionMajor": 0,
        "VersionMinor": 59,
        "VersionPatch": 5,
        "Changes": "<b>Version 0.59.5:</b><br><br>- The Restaurant Farmer can now automatically select moves based on type effectiveness.<br>- Hopefully fixed more Restaurant Farmer hangs. (reported by numerous people)<br>- Bench Sit should be less CPU resource intensive. (reported by dlewis3040)<br><br><b>Version 0.59.4:</b><br><br>- The Restaurant Farmer now has a button to stop after the current run.<br>- More fixes to the Restaurant Farmer. (reported by elitheguy, frostedgeulleisia, and mendedpearl)"
    },
    "PrivateBeta": {
        "VersionMajor": 0,
        "VersionMinor": 61,
        "VersionPatch": 2,
        "Changes": <b>Version 0.61.2 (beta):</b><br><br>- Added preliminary Donut Maker. (credit kichi, Gin)<br>- Improved reliability of box detection. (reported by Dhruv, Quantum, credit Gin)<br>- If the serial connection dies, it will now show a popup error. (reported by jayfeather1)<br>- New Pico firmware with a promising fix for an ongoing issue where it may hang in Sword/Shield. (reported by h0ly0 and tryvl)<br><br>This beta contains a preliminary release of the Donut Maker that uses text recognition for the powers. Text recognition is unreliable so we intended to do a more robust implementation using sprite detection. But that was taking too long. So we are starting with a quick-and-dirty version using only text. If it proves unreliable as predicted, we'll follow up later with sprite matching.<br><br>Meanwhile the legendary hunting program is underway though it won't be easy either."
    }
}
